Examples/Java/Healthcare/system-user-scenario-bearer/src/main/resources/WspHealthcareBearerExample.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="HelloWorld" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <wsp:Policy wsu:Id="WS2007FederationHttpBinding_IHelloWorld_policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:TransportBinding xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
                    <wsp:Policy>
                        <!--<sp:TransportToken>
                            <wsp:Policy>
                                <sp:HttpsToken>
                                    <wsp:policy />
                                </sp:HttpsToken>
                            </wsp:Policy>
                        </sp:TransportToken>-->
                        <sp:AlgorithmSuite>
                            <wsp:Policy>
                                <sp:Basic256Sha256/>
                            </wsp:Policy>
                        </sp:AlgorithmSuite>
                        <sp:Layout>
                            <wsp:Policy>
                                <sp:Strict/>
                            </wsp:Policy>
                        </sp:Layout>
                        <sp:IncludeTimestamp/>
                    </wsp:Policy>
                </sp:TransportBinding>
                <sp:SignedSupportingTokens xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
                    <wsp:Policy>
                        <sp:IssuedToken sp:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702/IncludeToken/AlwaysToRecipient">
                            <sp:RequestSecurityTokenTemplate>
                                <trust:TokenType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</trust:TokenType>
                                <trust:KeyType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType>
                                <trust:CanonicalizationAlgorithm xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://www.w3.org/2001/10/xml-exc-c14n#</trust:CanonicalizationAlgorithm>
                                <trust:EncryptionAlgorithm xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://www.w3.org/2001/04/xmlenc#aes256-cbc</trust:EncryptionAlgorithm>
                            </sp:RequestSecurityTokenTemplate>
                            <wsp:Policy>
                                <sp:RequireInternalReference/>
                            </wsp:Policy>
                        </sp:IssuedToken>
                    </wsp:Policy>
                </sp:SignedSupportingTokens>
                <sp:Wss11 xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
                    <wsp:Policy/>
                </sp:Wss11>
                <sp:Trust13 xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
                    <wsp:Policy>
                        <sp:MustSupportIssuedTokens/>
                        <sp:RequireClientEntropy/>
                        <sp:RequireServerEntropy/>
                    </wsp:Policy>
                </sp:Trust13>
                <wsaw:UsingAddressing/>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsdl:types>
        <xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
            <xs:element name="HelloNone">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="name" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="HelloNoneResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="HelloNoneResult" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="HelloNoneError">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="name" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="HelloNoneErrorResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="HelloNoneErrorResult" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="HelloSign">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="name" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="HelloSignResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="HelloSignResult" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="HelloSignError">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="name" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="HelloSignErrorResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="HelloSignErrorResult" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
        </xs:schema>
        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
            <xs:element name="anyType" nillable="true" type="xs:anyType"/>
            <xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
            <xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
            <xs:element name="boolean" nillable="true" type="xs:boolean"/>
            <xs:element name="byte" nillable="true" type="xs:byte"/>
            <xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
            <xs:element name="decimal" nillable="true" type="xs:decimal"/>
            <xs:element name="double" nillable="true" type="xs:double"/>
            <xs:element name="float" nillable="true" type="xs:float"/>
            <xs:element name="int" nillable="true" type="xs:int"/>
            <xs:element name="long" nillable="true" type="xs:long"/>
            <xs:element name="QName" nillable="true" type="xs:QName"/>
            <xs:element name="short" nillable="true" type="xs:short"/>
            <xs:element name="string" nillable="true" type="xs:string"/>
            <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
            <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
            <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
            <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
            <xs:element name="char" nillable="true" type="tns:char"/>
            <xs:simpleType name="char">
                <xs:restriction base="xs:int"/>
            </xs:simpleType>
            <xs:element name="duration" nillable="true" type="tns:duration"/>
            <xs:simpleType name="duration">
                <xs:restriction base="xs:duration">
                    <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
                    <xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
                    <xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
                </xs:restriction>
            </xs:simpleType>
            <xs:element name="guid" nillable="true" type="tns:guid"/>
            <xs:simpleType name="guid">
                <xs:restriction base="xs:string">
                    <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
                </xs:restriction>
            </xs:simpleType>
            <xs:attribute name="FactoryType" type="xs:QName"/>
            <xs:attribute name="Id" type="xs:ID"/>
            <xs:attribute name="Ref" type="xs:IDREF"/>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="IHelloWorld_HelloNone_InputMessage">
        <wsdl:part name="parameters" element="tns:HelloNone"/>
    </wsdl:message>
    <wsdl:message name="IHelloWorld_HelloNone_OutputMessage">
        <wsdl:part name="parameters" element="tns:HelloNoneResponse"/>
    </wsdl:message>
    <wsdl:message name="IHelloWorld_HelloNoneError_InputMessage">
        <wsdl:part name="parameters" element="tns:HelloNoneError"/>
    </wsdl:message>
    <wsdl:message name="IHelloWorld_HelloNoneError_OutputMessage">
        <wsdl:part name="parameters" element="tns:HelloNoneErrorResponse"/>
    </wsdl:message>
    <wsdl:message name="IHelloWorld_HelloSign_InputMessage">
        <wsdl:part name="parameters" element="tns:HelloSign"/>
    </wsdl:message>
    <wsdl:message name="IHelloWorld_HelloSign_OutputMessage">
        <wsdl:part name="parameters" element="tns:HelloSignResponse"/>
    </wsdl:message>
    <wsdl:message name="IHelloWorld_HelloSignError_InputMessage">
        <wsdl:part name="parameters" element="tns:HelloSignError"/>
    </wsdl:message>
    <wsdl:message name="IHelloWorld_HelloSignError_OutputMessage">
        <wsdl:part name="parameters" element="tns:HelloSignErrorResponse"/>
    </wsdl:message>
    <wsdl:portType name="IHelloWorld">
        <wsdl:operation name="HelloNone">
            <wsdl:input wsaw:Action="http://tempuri.org/IHelloWorld/HelloNone" message="tns:IHelloWorld_HelloNone_InputMessage"/>
            <wsdl:output wsaw:Action="http://tempuri.org/IHelloWorld/HelloNoneResponse" message="tns:IHelloWorld_HelloNone_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="HelloNoneError">
            <wsdl:input wsaw:Action="http://tempuri.org/IHelloWorld/HelloNoneError" message="tns:IHelloWorld_HelloNoneError_InputMessage"/>
            <wsdl:output wsaw:Action="http://tempuri.org/IHelloWorld/HelloNoneErrorResponse" message="tns:IHelloWorld_HelloNoneError_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="HelloSign">
            <wsdl:input wsaw:Action="http://tempuri.org/IHelloWorld/HelloSign" message="tns:IHelloWorld_HelloSign_InputMessage"/>
            <wsdl:output wsaw:Action="http://tempuri.org/IHelloWorld/HelloSignResponse" message="tns:IHelloWorld_HelloSign_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="HelloSignError">
            <wsdl:input wsaw:Action="http://tempuri.org/IHelloWorld/HelloSignError" message="tns:IHelloWorld_HelloSignError_InputMessage"/>
            <wsdl:output wsaw:Action="http://tempuri.org/IHelloWorld/HelloSignErrorResponse" message="tns:IHelloWorld_HelloSignError_OutputMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="WS2007FederationHttpBinding_IHelloWorld" type="tns:IHelloWorld">
        <wsp:PolicyReference URI="#WS2007FederationHttpBinding_IHelloWorld_policy"/>
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="HelloNone">
            <soap12:operation soapAction="http://tempuri.org/IHelloWorld/HelloNone" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="HelloNoneError">
            <soap12:operation soapAction="http://tempuri.org/IHelloWorld/HelloNoneError" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="HelloSign">
            <soap12:operation soapAction="http://tempuri.org/IHelloWorld/HelloSign" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="HelloSignError">
            <soap12:operation soapAction="http://tempuri.org/IHelloWorld/HelloSignError" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="HelloWorld">
        <wsdl:port name="WS2007FederationHttpBinding_IHelloWorld" binding="tns:WS2007FederationHttpBinding_IHelloWorld">
            <soap12:address location="https://digst.oioidws.wsp:9090/helloworld"/>
            <wsa10:EndpointReference>
                <wsa10:Address>https://digst.oioidws.wsp:9090/helloworld</wsa10:Address>
            </wsa10:EndpointReference>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>